s1 = """
*** програма розроблена для викладачів,
    а саме - для трудовиків та фізруків"""
s2 = """
школяри та яблука
"""
s3 = """школяри ділять яблука порівну,а залишок, 
що не ділиться, залишають в кошику."""
s4 = """якщо бажаєте дізнатись скільки яблук дістанеться
кожному школяреві та скільки яблук залишиться в кошику """
s5 = "введіть дані нижче"
s6 = "усього яблук буде"
s7 = "у Вашому кошику (на закуску)"
s8 = "у кожного учня\t\t\t\t"
s9 = "шт."
s10 = "це не числа, пезезавантажте програму!"
print(s1)
print(s2.upper())
print(s3.capitalize()+"\n"+s4.capitalize()+"\n"+s5, ":")
n = input("кількість учнів = ")
if(n.isdigit()):
    n = int(n)
else:
    print(s10.upper())
    quit()
k = input("кількість яблук = ")
if(k.isdigit()):
    k = int(k)
else:
    print(s10.upper())
    quit()
a = k // n
b = k % n
print("\n"+s6,':'+"\n"+s7, b, s9+"\n"+s8, a, s9)