# ДЗ 11. Последовательности целых чисел.
# Программа запрашивает ввод с клавиатуры целых чисел до тех пор, пока не будет введено 0.
# После ввода 0 необходимо вывести следующую информацию на экран:
# Количество введенных чисел (последний 0 не считается)
# Сумму введенных чисел
# Среднее арифметическое всех введенных чисел (последний 0 не считается)
# Определить минимальное и максимальное значение (последний 0 не считается)
# Определить количество четных и нечетных элементов последовательности (последний 0 не считается)
# Пример:
# Введите число: 1
# Введите число: 2
# Введите число: 3
# Введите число: 0
# Результат:
# Количество введенных чисел 3
# Сумма введенных чисел 6
# Среднее арифметическое всех введенных чисел 2
# Минимум 1, максимум 3
# Парных 1, нечетных 2
# Использование списков не желательно.

